prod-deploy/results/prod-nolimit-scalability-20260716-162750/step1-scan/fio-S1-r3.txt
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 64 processes

storage_test: (groupid=0, jobs=64): err= 0: pid=2868647: Thu Jul 16 16:23:09 2026
  read: IOPS=11.0k, BW=2743MiB/s (2877MB/s)(482GiB/180009msec)
    slat (usec): min=1145, max=24377, avg=5830.12, stdev=2850.87
    clat (nsec): min=1474, max=525902k, avg=367018676.72, stdev=25443448.90
     lat (usec): min=1740, max=535729, avg=372849.17, stdev=25620.56
    clat percentiles (msec):
     |  1.00th=[  313],  5.00th=[  330], 10.00th=[  338], 20.00th=[  347],
     | 30.00th=[  355], 40.00th=[  363], 50.00th=[  368], 60.00th=[  372],
     | 70.00th=[  380], 80.00th=[  388], 90.00th=[  397], 95.00th=[  409],
     | 99.00th=[  426], 99.50th=[  435], 99.90th=[  451], 99.95th=[  460],
     | 99.99th=[  477]
   bw (  MiB/s): min= 1755, max= 3045, per=99.82%, avg=2738.51, stdev= 2.03, samples=11510
   iops        : min= 2670, max=12896, avg=10951.35, stdev=11.62, samples=23030
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%
  lat (msec)   : 100=0.03%, 250=0.08%, 500=99.85%, 750=0.01%
  cpu          : usr=0.05%, sys=0.36%, ctx=3963444, majf=2, minf=263183
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=1975289,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2743MiB/s (2877MB/s), 2743MiB/s-2743MiB/s (2877MB/s-2877MB/s), io=482GiB (518GB), run=180009-180009msec