prod-deploy/results/prod-nolimit-scalability-20260716-162750/step1-scan/fio-S4-r3.txt
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=4
...
fio-3.28
Starting 8 processes

storage_test: (groupid=0, jobs=8): err= 0: pid=2831395: Thu Jul 16 15:50:24 2026
  read: IOPS=4921, BW=1230MiB/s (1290MB/s)(216GiB/180002msec)
    slat (usec): min=1016, max=4923, avg=1624.61, stdev=242.75
    clat (nsec): min=963, max=8740.9k, avg=4876796.71, stdev=436832.85
     lat (usec): min=1357, max=10228, avg=6501.55, stdev=512.06
    clat percentiles (usec):
     |  1.00th=[ 4047],  5.00th=[ 4228], 10.00th=[ 4359], 20.00th=[ 4490],
     | 30.00th=[ 4621], 40.00th=[ 4752], 50.00th=[ 4817], 60.00th=[ 4948],
     | 70.00th=[ 5080], 80.00th=[ 5211], 90.00th=[ 5473], 95.00th=[ 5669],
     | 99.00th=[ 6063], 99.50th=[ 6259], 99.90th=[ 6718], 99.95th=[ 6915],
     | 99.99th=[ 7570]
   bw (  MiB/s): min= 1193, max= 1268, per=100.00%, avg=1230.49, stdev= 1.71, samples=1434
   iops        : min= 4698, max= 5156, avg=4921.91, stdev= 9.02, samples=2874
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%
  lat (msec)   : 2=0.01%, 4=0.67%, 10=99.33%
  cpu          : usr=0.07%, sys=0.75%, ctx=1773422, majf=2, minf=3253
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=885875,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1230MiB/s (1290MB/s), 1230MiB/s-1230MiB/s (1290MB/s-1290MB/s), io=216GiB (232GB), run=180002-180002msec